review-api/app/controllers/api/v1/properties_controller.rb

    def update
        @property = Api::V1::Property.find_by_id(params[:id])
        if params[:flag]
            @property.update(address: params[:address], photo: params[:image], paid: params[:paid], rent: params[:rent], expenses: params[:expenses])
        else
            @property.update(paid: !@property.paid)
---
UPDATE "api_v1_properties" SET "rent" = ?, "expenses" = ?, "updated_at" = ? WHERE "api_v1_properties"."id" = ?  [["rent", 2500], ["expenses", 500], ["updated_at", "2020-12-05 18:16:57.776462"], ["id", 3]]
UPDATE "api_v1_properties" SET "address" = ?, "paid" = ?, "rent" = ?, "expenses" = ?, "updated_at" = ? WHERE "api_v1_properties"."id" = ?  [["address", "22-35, 75th Street"], ["paid", nil], ["rent", 5000], ["expenses", 1000], ["updated_at", "2020-12-04 19:55:00.495017"], ["id", 3]]